In [2]:
# Incase of Single Variable, we had used 
# y = m * x + c  ; linear eqn ; where,
# m = reg.coef_ ; x = feature ; c = reg.intercept_

# Now, we are to find out or predict the Price
# when, Area = 3000 sqr ft; Bedrooms = 3 units; Age = 4 years
# y = (m1 * x1) + (m2 * x2) + (m3 * x3) + c

In [7]:
# For reading the file, i.e. dataset we will be calling
# read_csv(); and provide the destination path of dataset
# We are doing linear regression, so
# we will need "linear_model"
# sklearn -> linear_model -> LinearRegression

import pandas as pd
from sklearn import linear_model
df = pd.read_csv('/content/linregmulvar.csv')

In [ ]:
# For displaying the data from the dataset
# call "head()"

In [8]:
df.head()

   Area  Bedrooms  Age   Price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000

In [12]:
df.Bedrooms.median()

3.5

In [14]:
# for taking our value into floor() or ceil()
# we need to import math

import math
Med_Bed = math.floor(df.Bedrooms.median())

In [15]:
df.head()

   Area  Bedrooms  Age   Price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000

In [18]:
# Filling the value of NaN (null);
# using fillna()

df.Bedrooms = df.Bedrooms.fillna(Med_Bed)

In [19]:
df.head()

   Area  Bedrooms  Age   Price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       3.0   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000

In [24]:
mem = linear_model.LinearRegression()

# We need to fit our dataset, using fit()
# for target column, we need to use two third braces
# eg. if target is AREA; we will write [['AREA']]
# for feature column, if feature is AREA; simply use df.AREA

mem.fit(df[['Area', 'Bedrooms', 'Age']], df.Price)

LinearRegression()

In [25]:
mem.coef_    # here, we have got m1, m2, m3 ; 
             # which are co-efficient of x1, x2, x3 respectively.

array([   137.25, -26025.  ,  -6825.  ])

In [26]:
mem.intercept_

383724.99999999994

In [29]:
mem.predict([[3000, 3, 4]])  # Area, Bedrooms, Age
                             # x1, x2, x3

/usr/local/lib/python3.7/dist-packages/sklearn/base.py:446: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  "X does not have valid feature names, but"

array([690100.])

In [32]:
# m1x1 + m2x2 + m3x3 + c
# manual calculation

137.25*3000 + (-26025)*3 + (-6825)*4 + mem.intercept_

690100.0